import { Injectable } from '@angular/core';

const dataSource = [
  'Пункт 1',
  'Пункт 2',
  'Пункт 3',
  'Пункт 4',
  'Пункт 5',
  'Пункт 6',
  'Пункт 7',
  'Пункт 8',
  'Пункт 9',
  'Пункт 10',
  'Пункт 11',
  'Пункт 12',
];

const dataSource9 = [
  'Пункт 1',
  'Пункт 2',
  'Пункт 3',
  'Пункт 4',
  'Пункт 5',
  'Пункт 6',
  'Пункт 7',
  'Пункт 8',
  'Пункт 9',
];

const dataSource18 = [
  'Пункт 1',
  'Пункт 2',
  'Пункт 3',
  'Пункт 4',
  'Пункт 5',
  'Пункт 6',
  'Пункт 7',
  'Пункт 8',
  'Пункт 9',
  'Пункт 10',
  'Пункт 11',
  'Пункт 12',
  'Пункт 13',
  'Пункт 14',
  'Пункт 15',
  'Пункт 16',
  'Пункт 17',
  'Пункт 18',
];

const dataSource27 = [
  'Пункт 1',
  'Пункт 2',
  'Пункт 3',
  'Пункт 4',
  'Пункт 5',
  'Пункт 6',
  'Пункт 7',
  'Пункт 8',
  'Пункт 9',
  'Пункт 10',
  'Пункт 11',
  'Пункт 12',
  'Пункт 13',
  'Пункт 14',
  'Пункт 15',
  'Пункт 16',
  'Пункт 17',
  'Пункт 18',
  'Пункт 19',
  'Пункт 20',
  'Пункт 21',
  'Пункт 22',
  'Пункт 23',
  'Пункт 24',
  'Пункт 25',
  'Пункт 26',
  'Пункт 27',
];

@Injectable({
  providedIn: 'root',
})
export class SelectBoxDataService {
  getSource() {
    return dataSource;
  }

  getSource9() {
    return dataSource9;
  }

  getSource18() {
    return dataSource18;
  }

  getSource27() {
    return dataSource27;
  }
}
